load/wrk/results/rerun-20260307-2/tomcat-max50/blocking-sleep100-conn120-thr8.txt
Running 4s test @ http://localhost:8082/perf/blocking?sleepMs=100
  8 threads and 120 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   244.60ms   48.18ms 314.54ms   62.68%
    Req/Sec    59.68     21.62   120.00     74.68%
  Latency Distribution
     50%  217.34ms
     75%  300.42ms
     90%  305.86ms
     99%  313.18ms
  1900 requests in 4.03s, 407.87KB read
Requests/sec:    471.02
Transfer/sec:    101.11KB